fio4pi/results/6415-4w-rpi3-raspbian_v4.1.19-v7+.log
random-write-1: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
random-write-2: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
random-write-3: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
random-write-4: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
fio-2.6
Starting 4 processes
random-write-3: Laying out IO file(s) (1 file(s) / 1024MB)
random-write-4: Laying out IO file(s) (1 file(s) / 1024MB)

random-write-1: (groupid=0, jobs=1): err= 0: pid=3755: Sat Mar 19 19:47:39 2016
  write: io=1024.0MB, bw=30434B/s, iops=7, runt=35280263msec
    clat (usec): min=15, max=75201K, avg=134568.88, stdev=517802.65
     lat (usec): min=16, max=75201K, avg=134570.20, stdev=517802.68
    clat percentiles (usec):
     |  1.00th=[   18],  5.00th=[   20], 10.00th=[   20], 20.00th=[   22],
     | 30.00th=[   24], 40.00th=[   33], 50.00th=[199680], 60.00th=[199680],
     | 70.00th=[199680], 80.00th=[199680], 90.00th=[199680], 95.00th=[199680],
     | 99.00th=[716800], 99.50th=[1236992], 99.90th=[3588096], 99.95th=[9371648],
     | 99.99th=[12648448]
    bw (KB  /s): min=    0, max=31676, per=32.27%, avg=34.21, stdev=148.66
    lat (usec) : 20=4.12%, 50=39.38%, 100=1.40%, 250=0.01%, 500=0.01%
    lat (usec) : 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
    lat (msec) : 100=0.01%, 250=52.95%, 500=0.66%, 750=0.48%, 1000=0.23%
    lat (msec) : 2000=0.52%, >=2000=0.20%
  cpu          : usr=0.01%, sys=0.03%, ctx=157152, majf=0, minf=21
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=262144/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
random-write-2: (groupid=0, jobs=1): err= 0: pid=3756: Sat Mar 19 19:47:39 2016
  write: io=1024.0MB, bw=30434B/s, iops=7, runt=35280455msec
    clat (usec): min=15, max=75201K, avg=134569.81, stdev=517575.83
     lat (usec): min=16, max=75201K, avg=134571.17, stdev=517575.87
    clat percentiles (usec):
     |  1.00th=[   18],  5.00th=[   19], 10.00th=[   20], 20.00th=[   22],
     | 30.00th=[   23], 40.00th=[   33], 50.00th=[199680], 60.00th=[199680],
     | 70.00th=[199680], 80.00th=[199680], 90.00th=[199680], 95.00th=[199680],
     | 99.00th=[716800], 99.50th=[1236992], 99.90th=[3620864], 99.95th=[9371648],
     | 99.99th=[12648448]
    bw (KB  /s): min=    0, max=31283, per=32.28%, avg=34.22, stdev=147.02
    lat (usec) : 20=5.62%, 50=37.91%, 100=1.36%, 250=0.01%, 500=0.01%
    lat (usec) : 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
    lat (msec) : 100=0.02%, 250=52.95%, 500=0.67%, 750=0.47%, 1000=0.25%
    lat (msec) : 2000=0.51%, >=2000=0.20%
  cpu          : usr=0.01%, sys=0.03%, ctx=157151, majf=0, minf=20
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=262144/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
random-write-3: (groupid=0, jobs=1): err= 0: pid=3757: Sat Mar 19 19:47:39 2016
  write: io=1024.0MB, bw=28530B/s, iops=6, runt=37634708msec
    clat (usec): min=11, max=75001K, avg=143551.24, stdev=550221.18
     lat (usec): min=12, max=75001K, avg=143552.55, stdev=550221.24
    clat percentiles (usec):
     |  1.00th=[   13],  5.00th=[   17], 10.00th=[   19], 20.00th=[   21],
     | 30.00th=[   22], 40.00th=[   24], 50.00th=[   35], 60.00th=[199680],
     | 70.00th=[199680], 80.00th=[199680], 90.00th=[254976], 95.00th=[468992],
     | 99.00th=[1286144], 99.50th=[1646592], 99.90th=[4947968], 99.95th=[9371648],
     | 99.99th=[12648448]
    bw (KB  /s): min=    0, max=28176, per=32.79%, avg=34.76, stdev=147.05
    lat (usec) : 20=11.72%, 50=40.73%, 100=2.12%, 250=0.93%, 500=0.05%
    lat (usec) : 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.05%, 4=0.07%, 10=0.02%, 20=0.03%, 50=0.04%
    lat (msec) : 100=0.14%, 250=34.05%, 500=5.32%, 750=1.97%, 1000=0.93%
    lat (msec) : 2000=1.56%, >=2000=0.26%
  cpu          : usr=0.01%, sys=0.03%, ctx=153893, majf=0, minf=19
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=262144/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
random-write-4: (groupid=0, jobs=1): err= 0: pid=3758: Sat Mar 19 19:47:39 2016
  write: io=1024.0MB, bw=27278B/s, iops=6, runt=39362404msec
    clat (usec): min=11, max=75201K, avg=150141.51, stdev=554983.90
     lat (usec): min=12, max=75201K, avg=150142.82, stdev=554983.96
    clat percentiles (usec):
     |  1.00th=[   14],  5.00th=[   17], 10.00th=[   19], 20.00th=[   21],
     | 30.00th=[   22], 40.00th=[   25], 50.00th=[   45], 60.00th=[199680],
     | 70.00th=[199680], 80.00th=[199680], 90.00th=[259072], 95.00th=[473088],
     | 99.00th=[1400832], 99.50th=[1695744], 99.90th=[4816896], 99.95th=[9502720],
     | 99.99th=[12648448]
    bw (KB  /s): min=    0, max=52643, per=31.81%, avg=33.71, stdev=248.65
    lat (usec) : 20=11.87%, 50=38.61%, 100=2.10%, 250=1.31%, 500=0.05%
    lat (usec) : 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.02%, 10=0.01%, 20=0.01%, 50=0.02%
    lat (msec) : 100=0.03%, 250=35.85%, 500=5.32%, 750=1.85%, 1000=0.97%
    lat (msec) : 2000=1.68%, >=2000=0.30%
  cpu          : usr=0.01%, sys=0.03%, ctx=159945, majf=0, minf=22
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=262144/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: io=4096.0MB, aggrb=106KB/s, minb=26KB/s, maxb=29KB/s, mint=35280263msec, maxt=39362404msec

Disk stats (read/write):
  mmcblk0: ios=34/978513, merge=0/64510, ticks=14660/865034990, in_queue=865068470, util=100.00%