fio4pi/results/6416-1r-rpi3-raspbian_v4.1.19-v7+.log
random-read: (g=0): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
fio-2.6
Starting 1 process
random-read: Laying out IO file(s) (1 file(s) / 128MB)

random-read: (groupid=0, jobs=1): err= 0: pid=1084: Sat Mar 19 22:06:59 2016
  read : io=131072KB, bw=7525.1KB/s, iops=1881, runt= 17418msec
    clat (usec): min=327, max=2180, avg=522.27, stdev=120.44
     lat (usec): min=328, max=2181, avg=523.14, stdev=120.45
    clat percentiles (usec):
     |  1.00th=[  346],  5.00th=[  366], 10.00th=[  374], 20.00th=[  390],
     | 30.00th=[  454], 40.00th=[  462], 50.00th=[  474], 60.00th=[  628],
     | 70.00th=[  644], 80.00th=[  652], 90.00th=[  668], 95.00th=[  668],
     | 99.00th=[  676], 99.50th=[  684], 99.90th=[  748], 99.95th=[ 1128],
     | 99.99th=[ 1944]
    bw (KB  /s): min= 7392, max= 7656, per=99.68%, avg=7500.71, stdev=58.39
    lat (usec) : 500=57.75%, 750=42.16%, 1000=0.04%
    lat (msec) : 2=0.05%, 4=0.01%
  cpu          : usr=1.44%, sys=4.82%, ctx=33450, majf=0, minf=18
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=32768/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=131072KB, aggrb=7525KB/s, minb=7525KB/s, maxb=7525KB/s, mint=17418msec, maxt=17418msec

Disk stats (read/write):
  mmcblk0: ios=32625/0, merge=0/0, ticks=16220/0, in_queue=16170, util=92.70%