fio4pi/results/6416-1w-rpi3-raspbian_v4.1.19-v7+.log
random-write: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
fio-2.6
Starting 1 process
random-write: Laying out IO file(s) (1 file(s) / 1024MB)

random-write: (groupid=0, jobs=1): err= 0: pid=1090: Sat Mar 19 22:29:14 2016
  write: io=1024.0MB, bw=804235B/s, iops=196, runt=1335108msec
    clat (usec): min=11, max=4455.9K, avg=5084.25, stdev=53325.10
     lat (usec): min=12, max=4455.9K, avg=5085.31, stdev=53325.11
    clat percentiles (usec):
     |  1.00th=[   12],  5.00th=[   12], 10.00th=[   13], 20.00th=[   13],
     | 30.00th=[   14], 40.00th=[   14], 50.00th=[   17], 60.00th=[   19],
     | 70.00th=[   20], 80.00th=[   21], 90.00th=[   32], 95.00th=[ 9664],
     | 99.00th=[119296], 99.50th=[199680], 99.90th=[765952], 99.95th=[847872],
     | 99.99th=[1695744]
    bw (KB  /s): min=    1, max=188312, per=100.00%, avg=938.81, stdev=8040.91
    lat (usec) : 20=66.82%, 50=24.51%, 100=1.23%, 250=0.53%, 500=0.03%
    lat (usec) : 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.02%, 10=1.88%, 20=1.75%, 50=1.57%
    lat (msec) : 100=0.51%, 250=0.84%, 500=0.01%, 750=0.15%, 1000=0.09%
    lat (msec) : 2000=0.02%, >=2000=0.01%
  cpu          : usr=0.14%, sys=0.39%, ctx=24656, majf=0, minf=21
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=262144/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: io=1024.0MB, aggrb=785KB/s, minb=785KB/s, maxb=785KB/s, mint=1335108msec, maxt=1335108msec

Disk stats (read/write):
  mmcblk0: ios=122/230951, merge=0/2513, ticks=5910/11908680, in_queue=11914310, util=99.94%