fio4pi/results/6417-1w-rpi3-raspbian_v4.1.19-v7+.log
random-write: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
fio-2.6
Starting 1 process
random-write: Laying out IO file(s) (1 file(s) / 1024MB)

random-write: (groupid=0, jobs=1): err= 0: pid=944: Sun Mar 20 03:18:17 2016
  write: io=1024.0MB, bw=953159B/s, iops=232, runt=1126508msec
    clat (usec): min=11, max=3462.8K, avg=4288.68, stdev=46254.69
     lat (usec): min=12, max=3462.8K, avg=4289.74, stdev=46254.70
    clat percentiles (usec):
     |  1.00th=[   12],  5.00th=[   12], 10.00th=[   13], 20.00th=[   13],
     | 30.00th=[   13], 40.00th=[   14], 50.00th=[   15], 60.00th=[   18],
     | 70.00th=[   19], 80.00th=[   20], 90.00th=[   24], 95.00th=[ 4192],
     | 99.00th=[98816], 99.50th=[199680], 99.90th=[651264], 99.95th=[757760],
     | 99.99th=[1482752]
    bw (KB  /s): min=    1, max=187008, per=100.00%, avg=1066.67, stdev=7487.25
    lat (usec) : 20=74.51%, 50=18.88%, 100=0.74%, 250=0.47%, 500=0.02%
    lat (usec) : 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.30%, 10=1.54%, 20=1.12%, 50=0.86%
    lat (msec) : 100=0.58%, 250=0.62%, 500=0.02%, 750=0.27%, 1000=0.03%
    lat (msec) : 2000=0.02%, >=2000=0.01%
  cpu          : usr=0.17%, sys=0.44%, ctx=18743, majf=0, minf=21
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=262144/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: io=1024.0MB, aggrb=930KB/s, minb=930KB/s, maxb=930KB/s, mint=1126508msec, maxt=1126508msec

Disk stats (read/write):
  mmcblk0: ios=46/233025, merge=0/2158, ticks=12730/10206650, in_queue=10228300, util=99.92%